Revit 2027 API
ExternalApplicationArray.Insert Method
Insert the specified item into the array.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Insert(
	IExternalApplication item,
	int index
)
Public Overridable Sub Insert (
	item As IExternalApplication,
	index As Integer
)
public:
virtual void Insert(
	IExternalApplication^ item,
	int index
)
abstract Insert :
        item : IExternalApplication *
        index : int -> unit
override Insert :
        item : IExternalApplication *
        index : int -> unit
Parameters
item IExternalApplication
The item to be inserted into the array.
index Int32
The item will be inserted before this index.
Return Value
Returns whether the item was inserted into the array.
See Also
Reference
ExternalApplicationArray Class
Autodesk.Revit.UI Namespace